In [1]:
#시간 관련 연습  (clss 와 함수 관련 미리 예습하기)
import pandas as pd
import datetime

In [2]:
format = "%Y-%m-%d %H:%M:%S"
time_str = "2022-03-04 13:01:30"
type(time_str)

str

In [3]:
time_datetime = datetime.datetime.strptime(time_str,format)  #datetime 형식으로 바꾸기
time_datetime

datetime.datetime(2022, 3, 4, 13, 1, 30)

In [4]:
type(time_datetime)

datetime.datetime

In [5]:
datetime.datetime.today() #now  / print를 쓰면 나중에 실제로 출력했을 때의 형태를 보여주는 것

datetime.datetime(2022, 3, 7, 9, 22, 8, 634328)

In [6]:
print(datetime.date.today())

2022-03-07

In [7]:
time_str_2 = time_datetime.strftime(format)  #다시 str 형태로 바꾸기
print(time_str_2)
print(type(time_str_2))

2022-03-04 13:01:30
<class 'str'>

In [8]:
pd.Timestamp(12345) #Timestamp 기본이 1970-01-01 00:00:00.0

Timestamp('1970-01-01 00:00:00.000012345')

In [41]:
pd.Timestamp(1234.11, unit= 'D')   # 기본:나노세크 단위로 계산 / unit으로 단위변경

Timestamp('1973-05-19 02:38:24')

In [10]:
pd.Timestamp('2022-03-04')

Timestamp('2022-03-04 00:00:00')

In [11]:
pd.Timestamp('2022-3')  #3월 시작일부터

Timestamp('2022-03-01 00:00:00')

In [12]:
pd.to_datetime('2022-03-04')

Timestamp('2022-03-04 00:00:00')

In [13]:
pd.to_datetime('2022-03-04 13')

Timestamp('2022-03-04 13:00:00')

In [14]:
pd.date_range('2022-1','2022-3-4',freq="W")  #freq='W' 일요일기준. 'W-MON:월요일기준'  freq='D':날짜기준

DatetimeIndex(['2022-01-02', '2022-01-09', '2022-01-16', '2022-01-23',
               '2022-01-30', '2022-02-06', '2022-02-13', '2022-02-20',
               '2022-02-27'],
              dtype='datetime64[ns]', freq='W-SUN')

In [15]:
pd.Period('2022-3-1', freq='D')

Period('2022-03-01', 'D')

In [16]:
pd.period_range('2022-1-1','2022-3-4',freq="M")  #pd.date_range 와의 차이 확인해두기

PeriodIndex(['2022-01', '2022-02', '2022-03'], dtype='period[M]')

In [17]:
#내가 태어나고 며칠이 지났을까
pd.period_range('1998-2-10','2022-3-4')

PeriodIndex(['1998-02-10', '1998-02-11', '1998-02-12', '1998-02-13',
             '1998-02-14', '1998-02-15', '1998-02-16', '1998-02-17',
             '1998-02-18', '1998-02-19',
             ...
             '2022-02-23', '2022-02-24', '2022-02-25', '2022-02-26',
             '2022-02-27', '2022-02-28', '2022-03-01', '2022-03-02',
             '2022-03-03', '2022-03-04'],
            dtype='period[D]', length=8789)

In [18]:
p = pd.Period('2022-3-4')
print(p.start_time)
print(p.end_time)

2022-03-04 00:00:00
2022-03-04 23:59:59.999999999

In [19]:
#시간 연산
print(pd.Timedelta('1 days'))
print(pd.Timedelta('1 days 2 hours'))
print(pd.Timedelta('-2 days 3min 3ns'))  #nano sec

1 days 00:00:00
1 days 02:00:00
-3 days +23:56:59.999999997

In [20]:
pd.Timedelta('10:00:00')  #시간에 대한 연산할 때 사용

Timedelta('0 days 10:00:00')

In [21]:
pd.Timestamp('1998-2-10') + pd.Timedelta("2days")

Timestamp('1998-02-12 00:00:00')

In [22]:
pd.Timestamp('2022-3-4')-pd.Timestamp('1998-2-10')

Timedelta('8788 days 00:00:00')

In [23]:
pd.Timedelta(days = 10, hours=5)

Timedelta('10 days 05:00:00')

i am using jupyter notebook in vscode which is ipynb
i hope my kernel works fine till this course is finished......

In [24]:
import numpy as np

In [25]:
s1 = pd.Series([1, np.nan, 3, 4, 5 ])
s2 = pd.Series([1, 2, np.nan, 4, 5])
s3 = pd.Series([1, 2, 3, np.nan, 5])
df = pd.DataFrame({'s1':s1, 's2':s2, 's3':s3})
df

    s1   s2   s3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [26]:
#NaN값 확인하기 

df["s1"].isna()  #NaN-> True

0    False
1     True
2    False
3    False
4    False
Name: s1, dtype: bool

In [27]:
df.isna()

      s1     s2     s3
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False   True
4  False  False  False

In [28]:
#True == 1
True == 0
#False ==0

False

In [29]:
df.isna().sum() # NaN 몇개인지 찾기 , 데이터를 불러온 다음 결측치 찾을 때 필요

s1    1
s2    1
s3    1
dtype: int64

In [30]:
#결측치를 지워보자

df.dropna(axis=0)  #axis='rows' 해도 됨

    s1   s2   s3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [31]:
df.dropna(axis='columns')  #axis=1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [32]:
# add
df['s1'] += 1
df

    s1   s2   s3
0  2.0  1.0  1.0
1  NaN  2.0  2.0
2  4.0  NaN  3.0
3  5.0  4.0  NaN
4  6.0  5.0  5.0

In [33]:
_list = [5,4,3,2,1]
df['s2'] += _list
df

    s1   s2   s3
0  2.0  6.0  1.0
1  NaN  6.0  2.0
2  4.0  NaN  3.0
3  5.0  6.0  NaN
4  6.0  6.0  5.0

In [34]:
_tuple = (1,2,3,4,5)
df['s3'] += _tuple
df

    s1   s2    s3
0  2.0  6.0   2.0
1  NaN  6.0   4.0
2  4.0  NaN   6.0
3  5.0  6.0   NaN
4  6.0  6.0  10.0

In [35]:
# 행렬 곱 : 첫번째 열과 두번째 행의 수 같아야 함

_list2 = [2,1,2]
dot_result = df @ _list2  #df.dot(_list2) 해도 됨 
dot_result

0    14.0
1     NaN
2     NaN
3     NaN
4    38.0
dtype: float64

In [36]:
# 행렬 곱을 할 때는 col,index 같아야함

df_2= pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=('s1','s2','s3'))

df_2

    0  1  2
s1  1  2  3
s2  4  5  6
s3  7  8  9

In [37]:
df.dot(df_2)

       0      1      2
0   40.0   50.0   60.0
1    NaN    NaN    NaN
2    NaN    NaN    NaN
3    NaN    NaN    NaN
4  100.0  122.0  144.0

In [38]:
#numpy로 해보기 
df.to_numpy()

array([[ 2.,  6.,  2.],
       [nan,  6.,  4.],
       [ 4., nan,  6.],
       [ 5.,  6., nan],
       [ 6.,  6., 10.]])

In [39]:
df.to_numpy().dot(df_2.to_numpy())

array([[ 40.,  50.,  60.],
       [ nan,  nan,  nan],
       [ nan,  nan,  nan],
       [ nan,  nan,  nan],
       [100., 122., 144.]])